Tekla Open API Reference for Tekla Structures 2025
Part.PartNumber Property
 Gets or sets the part number. Defines the numbering in the part sense.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public NumberingSeries PartNumber { get; set; }
Public Property PartNumber As NumberingSeries
	Get
	Set
Property Value
Type: NumberingSeries
See Also
Reference
Part Class
Tekla.Structures.Model Namespace